zejun051019/2026-NUEDC-H-MSPM0G3507/include/core/ti/devices/msp/peripherals/hw_aesadv.h
typedef struct {
  __IO uint32_t PWREN;                             /* !< (@ 0x00000800) Power enable */
  __O  uint32_t RSTCTL;                            /* !< (@ 0x00000804) Reset Control */
       uint32_t RESERVED0[3];
  __I  uint32_t STAT;                              /* !< (@ 0x00000814) Status Register */
} AESADV_GPRCM_Regs;

/*@}*/ /* end of group AESADV_GPRCM */

/** @addtogroup AESADV
  @{
*/

typedef struct {
       uint32_t RESERVED0[512];
  AESADV_GPRCM_Regs  GPRCM;                             /* !< (@ 0x00000800) */
       uint32_t RESERVED1[512];
  __I  uint32_t PDBGCTL;                           /* !< (@ 0x00001018) Peripheral Debug Control */
       uint32_t RESERVED2;
  AESADV_CPU_INT_Regs  CPU_INT;                           /* !< (@ 0x00001020) */
       uint32_t RESERVED3;
  AESADV_DMA_TRIG_DATAIN_Regs  DMA_TRIG_DATAIN;                   /* !< (@ 0x00001050) */
       uint32_t RESERVED4;
  AESADV_DMA_TRIG_DATAOUT_Regs  DMA_TRIG_DATAOUT;                  /* !< (@ 0x00001080) */
       uint32_t RESERVED5[13];
  __IO uint32_t EVT_MODE;                          /* !< (@ 0x000010E0) Event Mode */
       uint32_t RESERVED6[7];
  __O  uint32_t GCMCCM_TAG0;                       /* !< (@ 0x00001100) CBC-MAC third key (LSW) / GCM & CCM Intermediate
                                                      TAG (LSW) */
  __O  uint32_t GCMCCM_TAG1;                       /* !< (@ 0x00001104) CBC-MAC third key / GCM & CCM Intermediate TAG */
  __O  uint32_t GCMCCM_TAG2;                       /* !< (@ 0x00001108) CBC-MAC third key / GCM & CCM Intermediate TAG */
  __O  uint32_t GCMCCM_TAG3;                       /* !< (@ 0x0000110C) CBC-MAC third key (MSW) / GCM & CCM Intermediate
                                                      TAG (MSW) */
  __O  uint32_t GHASH_H0;                          /* !< (@ 0x00001110) CCM & CBC-MAC second key (LSW) / GCM Hash Key
                                                      input (LSW) */
  __O  uint32_t GHASH_H1;                          /* !< (@ 0x00001114) CCM & CBC-MAC second key  / GCM Hash Key input */
  __O  uint32_t GHASH_H2;                          /* !< (@ 0x00001118) CCM & CBC-MAC second key  / GCM Hash Key input */
  __O  uint32_t GHASH_H3;                          /* !< (@ 0x0000111C) CCM & CBC-MAC second key (MSW) / GCM Hash Key
                                                      input (MSW) */
  __O  uint32_t KEY0;                              /* !< (@ 0x00001120) KEY (LSW) */
  __O  uint32_t KEY1;                              /* !< (@ 0x00001124) KEY */
  __O  uint32_t KEY2;                              /* !< (@ 0x00001128) KEY */
  __O  uint32_t KEY3;                              /* !< (@ 0x0000112C) KEY */
  __O  uint32_t KEY4;                              /* !< (@ 0x00001130) KEY */
  __O  uint32_t KEY5;                              /* !< (@ 0x00001134) KEY */
  __O  uint32_t KEY6;                              /* !< (@ 0x00001138) KEY */
  __O  uint32_t KEY7;                              /* !< (@ 0x0000113C) KEY (MSW) */
  __IO uint32_t IV0;                               /* !< (@ 0x00001140) IV (LSW) */
  __IO uint32_t IV1;                               /* !< (@ 0x00001144) IV */
  __IO uint32_t IV2;                               /* !< (@ 0x00001148) IV */
  __IO uint32_t IV3;                               /* !< (@ 0x0000114C) IV */
  __IO uint32_t CTRL;                              /* !< (@ 0x00001150) Input/Output Buffer Control and Mode selection */
  __O  uint32_t C_LENGTH_0;                        /* !< (@ 0x00001154) Crypto data length (LSW) */
  __O  uint32_t C_LENGTH_1;                        /* !< (@ 0x00001158) Crypto data length (MSW) */
  __O  uint32_t AAD_LENGTH;                        /* !< (@ 0x0000115C) AAD Data Length */
  __IO uint32_t DATA0;                             /* !< (@ 0x00001160) Data input (LSW) / Data output (LSW) */
  __IO uint32_t DATA1;                             /* !< (@ 0x00001164) Data input / Data output */
  __IO uint32_t DATA2;                             /* !< (@ 0x00001168) Data input / Data output */
  __IO uint32_t DATA3;                             /* !< (@ 0x0000116C) Data input (LSW) / Data output (MSW) */
  __I  uint32_t TAG0;                              /* !< (@ 0x00001170) Hash result (LSW) */
  __I  uint32_t TAG1;                              /* !< (@ 0x00001174) Hash result */
  __I  uint32_t TAG2;                              /* !< (@ 0x00001178) Hash result */
  __I  uint32_t TAG3;                              /* !< (@ 0x0000117C) Hash result (MSW) */
  __I  uint32_t STATUS;                            /* !< (@ 0x00001180) Status */
  __O  uint32_t DATA_IN;                           /* !< (@ 0x00001184) Data in alias register */
  __I  uint32_t DATA_OUT;                          /* !< (@ 0x00001188) Data out alias register */
       uint32_t RESERVED7[17];
  __O  uint32_t FORCE_IN_AV;                       /* !< (@ 0x000011D0) Data control register for input data */
  __IO uint32_t CCM_ALN_WRD;                       /* !< (@ 0x000011D4) AES-CCM AAD alignment data word */
  __IO uint32_t BLK_CNT0;                          /* !< (@ 0x000011D8) Internal block counter (LSW) */
  __IO uint32_t BLK_CNT1;                          /* !< (@ 0x000011DC) Internal block counter (MSW) */
       uint32_t RESERVED8[5];
  __IO uint32_t DMA_HS;                            /* !< (@ 0x000011F4) Control register for DMA handshaking */
} AESADV_Regs;

/*@}*/ /* end of group AESADV */



#if defined ( __CC_ARM )
#pragma no_anon_unions
#endif

/******************************************************************************
* AESADV Register Control Bits - AESADV寄存器位域定义
* 包含：中断/DMA触发、电源/复位控制、事件模式、加密控制/密钥/数据/标签位域
******************************************************************************/

/* AESADV_DMA_TRIG_DATAOUT_IIDX Bits */
/* AESADV_DMA_TRIG_DATAOUT_IIDX[STAT] Bits */
#define AESADV_DMA_TRIG_DATAOUT_IIDX_STAT_OFS    (0)                             /* !< STAT Offset */
#define AESADV_DMA_TRIG_DATAOUT_IIDX_STAT_MASK   ((uint32_t)0x000000FFU)         /* !< Interrupt index status */
#define AESADV_DMA_TRIG_DATAOUT_IIDX_STAT_NO_INTR ((uint32_t)0x00000000U)         /* !< No interrupt pending */
#define AESADV_DMA_TRIG_DATAOUT_IIDX_STAT_TRIG1  ((uint32_t)0x00000001U)         /* !< AES DMA Trigger 1 (Data Output
                                                                                    trigger) */

/* AESADV_DMA_TRIG_DATAOUT_IMASK Bits */
/* AESADV_DMA_TRIG_DATAOUT_IMASK[TRIG1] Bits */
#define AESADV_DMA_TRIG_DATAOUT_IMASK_TRIG1_OFS  (0)                             /* !< TRIG1 Offset */
#define AESADV_DMA_TRIG_DATAOUT_IMASK_TRIG1_MASK ((uint32_t)0x00000001U)         /* !< TRIG1 event mask. */
#define AESADV_DMA_TRIG_DATAOUT_IMASK_TRIG1_CLR  ((uint32_t)0x00000000U)         /* !< Clear Interrupt Mask */
#define AESADV_DMA_TRIG_DATAOUT_IMASK_TRIG1_SET  ((uint32_t)0x00000001U)         /* !< Set Interrrupt Mask */

/* AESADV_DMA_TRIG_DATAOUT_RIS Bits */
/* AESADV_DMA_TRIG_DATAOUT_RIS[TRIG1] Bits */
#define AESADV_DMA_TRIG_DATAOUT_RIS_TRIG1_OFS    (0)                             /* !< TRIG1 Offset */
#define AESADV_DMA_TRIG_DATAOUT_RIS_TRIG1_MASK   ((uint32_t)0x00000001U)         /* !< TRIG1 event */
#define AESADV_DMA_TRIG_DATAOUT_RIS_TRIG1_CLR    ((uint32_t)0x00000000U)         /* !< Interrupt did not occur */
#define AESADV_DMA_TRIG_DATAOUT_RIS_TRIG1_SET    ((uint32_t)0x00000001U)         /* !< Interrupt occured */

