zejun051019/2026-NUEDC-H-MSPM0G3507/include/core/ti/devices/msp/peripherals/hw_aesadv.h
/* AESADV_DMA_TRIG_DATAOUT_MIS Bits */
/* AESADV_DMA_TRIG_DATAOUT_MIS[TRIG1] Bits */
#define AESADV_DMA_TRIG_DATAOUT_MIS_TRIG1_OFS    (0)                             /* !< TRIG1 Offset */
#define AESADV_DMA_TRIG_DATAOUT_MIS_TRIG1_MASK   ((uint32_t)0x00000001U)         /* !< TRIG1 event */
#define AESADV_DMA_TRIG_DATAOUT_MIS_TRIG1_CLR    ((uint32_t)0x00000000U)         /* !< Interrupt did not occur */
#define AESADV_DMA_TRIG_DATAOUT_MIS_TRIG1_SET    ((uint32_t)0x00000001U)         /* !< Interrupt occured */

/* AESADV_DMA_TRIG_DATAOUT_ISET Bits */
/* AESADV_DMA_TRIG_DATAOUT_ISET[TRIG1] Bits */
#define AESADV_DMA_TRIG_DATAOUT_ISET_TRIG1_OFS   (0)                             /* !< TRIG1 Offset */
#define AESADV_DMA_TRIG_DATAOUT_ISET_TRIG1_MASK  ((uint32_t)0x00000001U)         /* !< TRIG1 event */
#define AESADV_DMA_TRIG_DATAOUT_ISET_TRIG1_NO_EFFECT ((uint32_t)0x00000000U)         /* !< Writing 0 has no effect */
#define AESADV_DMA_TRIG_DATAOUT_ISET_TRIG1_SET   ((uint32_t)0x00000001U)         /* !< Set Interrupt */

/* AESADV_DMA_TRIG_DATAOUT_ICLR Bits */
/* AESADV_DMA_TRIG_DATAOUT_ICLR[TRIG1] Bits */
#define AESADV_DMA_TRIG_DATAOUT_ICLR_TRIG1_OFS   (0)                             /* !< TRIG1 Offset */
#define AESADV_DMA_TRIG_DATAOUT_ICLR_TRIG1_MASK  ((uint32_t)0x00000001U)         /* !< TRIG1 event */
#define AESADV_DMA_TRIG_DATAOUT_ICLR_TRIG1_NO_EFFECT ((uint32_t)0x00000000U)         /* !< Writing 0 has no effect */
#define AESADV_DMA_TRIG_DATAOUT_ICLR_TRIG1_CLR   ((uint32_t)0x00000001U)         /* !< Clear Interrupt */

/* AESADV_DMA_TRIG_DATAIN_IIDX Bits */
/* AESADV_DMA_TRIG_DATAIN_IIDX[STAT] Bits */
#define AESADV_DMA_TRIG_DATAIN_IIDX_STAT_OFS     (0)                             /* !< STAT Offset */
#define AESADV_DMA_TRIG_DATAIN_IIDX_STAT_MASK    ((uint32_t)0x000000FFU)         /* !< Interrupt index status */
#define AESADV_DMA_TRIG_DATAIN_IIDX_STAT_NO_INTR ((uint32_t)0x00000000U)         /* !< No interrupt pending */
#define AESADV_DMA_TRIG_DATAIN_IIDX_STAT_TRIG0   ((uint32_t)0x00000001U)         /* !< AES trigger 0 DMA (Data Input
                                                                                    trigger) */

/* AESADV_DMA_TRIG_DATAIN_IMASK Bits */
/* AESADV_DMA_TRIG_DATAIN_IMASK[TRIG0] Bits */
#define AESADV_DMA_TRIG_DATAIN_IMASK_TRIG0_OFS   (0)                             /* !< TRIG0 Offset */
#define AESADV_DMA_TRIG_DATAIN_IMASK_TRIG0_MASK  ((uint32_t)0x00000001U)         /* !< TRIG0 event mask. */
#define AESADV_DMA_TRIG_DATAIN_IMASK_TRIG0_CLR   ((uint32_t)0x00000000U)         /* !< Clear Interrupt Mask */
#define AESADV_DMA_TRIG_DATAIN_IMASK_TRIG0_SET   ((uint32_t)0x00000001U)         /* !< Set Interrrupt Mask */

/* AESADV_DMA_TRIG_DATAIN_RIS Bits */
/* AESADV_DMA_TRIG_DATAIN_RIS[TRIG0] Bits */
#define AESADV_DMA_TRIG_DATAIN_RIS_TRIG0_OFS     (0)                             /* !< TRIG0 Offset */
#define AESADV_DMA_TRIG_DATAIN_RIS_TRIG0_MASK    ((uint32_t)0x00000001U)         /* !< TRIG0 event */
#define AESADV_DMA_TRIG_DATAIN_RIS_TRIG0_CLR     ((uint32_t)0x00000000U)         /* !< Interrupt did not occur */
#define AESADV_DMA_TRIG_DATAIN_RIS_TRIG0_SET     ((uint32_t)0x00000001U)         /* !< Interrupt occured */

/* AESADV_DMA_TRIG_DATAIN_MIS Bits */
/* AESADV_DMA_TRIG_DATAIN_MIS[TRIG0] Bits */
#define AESADV_DMA_TRIG_DATAIN_MIS_TRIG0_OFS     (0)                             /* !< TRIG0 Offset */
#define AESADV_DMA_TRIG_DATAIN_MIS_TRIG0_MASK    ((uint32_t)0x00000001U)         /* !< TRIG0 event */
#define AESADV_DMA_TRIG_DATAIN_MIS_TRIG0_CLR     ((uint32_t)0x00000000U)         /* !< Interrupt did not occur */
#define AESADV_DMA_TRIG_DATAIN_MIS_TRIG0_SET     ((uint32_t)0x00000001U)         /* !< Interrupt occured */

/* AESADV_DMA_TRIG_DATAIN_ISET Bits */
/* AESADV_DMA_TRIG_DATAIN_ISET[TRIG0] Bits */
#define AESADV_DMA_TRIG_DATAIN_ISET_TRIG0_OFS    (0)                             /* !< TRIG0 Offset */
#define AESADV_DMA_TRIG_DATAIN_ISET_TRIG0_MASK   ((uint32_t)0x00000001U)         /* !< TRIG0 */
#define AESADV_DMA_TRIG_DATAIN_ISET_TRIG0_NO_EFFECT ((uint32_t)0x00000000U)         /* !< Writing 0 has no effect */
#define AESADV_DMA_TRIG_DATAIN_ISET_TRIG0_SET    ((uint32_t)0x00000001U)         /* !< Set Interrupt */

/* AESADV_DMA_TRIG_DATAIN_ICLR Bits */
/* AESADV_DMA_TRIG_DATAIN_ICLR[TRIG0] Bits */
#define AESADV_DMA_TRIG_DATAIN_ICLR_TRIG0_OFS    (0)                             /* !< TRIG0 Offset */
#define AESADV_DMA_TRIG_DATAIN_ICLR_TRIG0_MASK   ((uint32_t)0x00000001U)         /* !< TRIG0 event */
#define AESADV_DMA_TRIG_DATAIN_ICLR_TRIG0_NO_EFFECT ((uint32_t)0x00000000U)         /* !< Writing 0 has no effect */
#define AESADV_DMA_TRIG_DATAIN_ICLR_TRIG0_CLR    ((uint32_t)0x00000001U)         /* !< Clear Interrupt */

/* AESADV_CPU_INT_IIDX Bits */
/* AESADV_CPU_INT_IIDX[STAT] Bits */
#define AESADV_CPU_INT_IIDX_STAT_OFS             (0)                             /* !< STAT Offset */
#define AESADV_CPU_INT_IIDX_STAT_MASK            ((uint32_t)0x000000FFU)         /* !< Interrupt index status */
#define AESADV_CPU_INT_IIDX_STAT_NO_INTR         ((uint32_t)0x00000000U)         /* !< No interrupt pending */
#define AESADV_CPU_INT_IIDX_STAT_OUTPUTRDY       ((uint32_t)0x00000001U)         /* !< This indicates that the core has an
                                                                                    output available to be read out. This
                                                                                    should not be used if DMA handshake
                                                                                    is used (AES_DMA_HS.DMA_DATA_ACK set
                                                                                    to 1) */
#define AESADV_CPU_INT_IIDX_STAT_INPUTRDY        ((uint32_t)0x00000002U)         /* !< This indicates that the engine can
                                                                                    take new input. This should not be
                                                                                    used if DMA handshake is used
                                                                                    (AES_DMA_HS.DMA_DATA_ACK set to 1) */
#define AESADV_CPU_INT_IIDX_STAT_SAVEDCNTXTRDY   ((uint32_t)0x00000003U)         /* !< This bit indicates that an AES
                                                                                    authentication TAG and/or IV block(s)
                                                                                    is/are available for the CPU to
                                                                                    retrieve. This bit is only asserted
                                                                                    if the save_context bit is set to 1b.
                                                                                    The bit is mutually exclusive with
                                                                                    the context_ready bit. */
#define AESADV_CPU_INT_IIDX_STAT_CNTXTRDY        ((uint32_t)0x00000004U)         /* !< This bit indicates that the context
                                                                                    data registers can be overwritten,
                                                                                    and the CPU is permitted to write new
                                                                                    context. */

/* AESADV_CPU_INT_IMASK Bits */
/* AESADV_CPU_INT_IMASK[OUTPUTRDY] Bits */
#define AESADV_CPU_INT_IMASK_OUTPUTRDY_OFS       (0)                             /* !< OUTPUTRDY Offset */
#define AESADV_CPU_INT_IMASK_OUTPUTRDY_MASK      ((uint32_t)0x00000001U)         /* !< This indicates that the core has an
                                                                                    output available to be read out. This
                                                                                    should not be used if DMA handshake
                                                                                    is used (AES_DMA_HS.DMA_DATA_ACK set
                                                                                    to 1) */
#define AESADV_CPU_INT_IMASK_OUTPUTRDY_CLR       ((uint32_t)0x00000000U)         /* !< Clear Interrupt Mask */
#define AESADV_CPU_INT_IMASK_OUTPUTRDY_SET       ((uint32_t)0x00000001U)         /* !< Set Interrrupt Mask */
/* AESADV_CPU_INT_IMASK[INPUTRDY] Bits */
#define AESADV_CPU_INT_IMASK_INPUTRDY_OFS        (1)                             /* !< INPUTRDY Offset */
#define AESADV_CPU_INT_IMASK_INPUTRDY_MASK       ((uint32_t)0x00000002U)         /* !< This indicates that the engine can
                                                                                    take new input. This should not be
                                                                                    used if DMA handshake is used
                                                                                    (AES_DMA_HS.DMA_DATA_ACK set to 1) */
#define AESADV_CPU_INT_IMASK_INPUTRDY_CLR        ((uint32_t)0x00000000U)         /* !< Clear Interrupt Mask */
#define AESADV_CPU_INT_IMASK_INPUTRDY_SET        ((uint32_t)0x00000002U)         /* !< Set Interrrupt Mask */
/* AESADV_CPU_INT_IMASK[SAVEDCNTXTRDY] Bits */
#define AESADV_CPU_INT_IMASK_SAVEDCNTXTRDY_OFS   (2)                             /* !< SAVEDCNTXTRDY Offset */
#define AESADV_CPU_INT_IMASK_SAVEDCNTXTRDY_MASK  ((uint32_t)0x00000004U)         /* !< This bit indicates that an AES
                                                                                    authentication TAG and/or IV block(s)
                                                                                    is/are available for the CPU to
                                                                                    retrieve. This bit is only asserted
                                                                                    if the save_context bit is set to 1b.
                                                                                    The bit is mutually exclusive with
                                                                                    the context_ready bit. */
#define AESADV_CPU_INT_IMASK_SAVEDCNTXTRDY_CLR   ((uint32_t)0x00000000U)         /* !< Clear Interrupt Mask */
#define AESADV_CPU_INT_IMASK_SAVEDCNTXTRDY_SET   ((uint32_t)0x00000004U)         /* !< Set Interrrupt Mask */
/* AESADV_CPU_INT_IMASK[CNTXTRDY] Bits */
#define AESADV_CPU_INT_IMASK_CNTXTRDY_OFS        (3)                             /* !< CNTXTRDY Offset */
#define AESADV_CPU_INT_IMASK_CNTXTRDY_MASK       ((uint32_t)0x00000008U)         /* !< This bit indicates that the context
                                                                                    data registers can be overwritten,
                                                                                    and the CPU is permitted to write
                                                                                    next context. */
#define AESADV_CPU_INT_IMASK_CNTXTRDY_CLR        ((uint32_t)0x00000000U)         /* !< Clear Interrupt Mask */
#define AESADV_CPU_INT_IMASK_CNTXTRDY_SET        ((uint32_t)0x00000008U)         /* !< Set Interrrupt Mask */

/* AESADV_CPU_INT_RIS Bits */
/* AESADV_CPU_INT_RIS[OUTPUTRDY] Bits */
#define AESADV_CPU_INT_RIS_OUTPUTRDY_OFS         (0)                             /* !< OUTPUTRDY Offset */
#define AESADV_CPU_INT_RIS_OUTPUTRDY_MASK        ((uint32_t)0x00000001U)         /* !< This indicates that the core has an
                                                                                    output available to be read out. This
                                                                                    should not be used if DMA handshake
                                                                                    is used (AES_DMA_HS.DMA_DATA_ACK set
                                                                                    to 1) */
#define AESADV_CPU_INT_RIS_OUTPUTRDY_CLR         ((uint32_t)0x00000000U)         /* !< Interrupt did not occur */
#define AESADV_CPU_INT_RIS_OUTPUTRDY_SET         ((uint32_t)0x00000001U)         /* !< Interrupt occured */
/* AESADV_CPU_INT_RIS[INPUTRDY] Bits */
#define AESADV_CPU_INT_RIS_INPUTRDY_OFS          (1)                             /* !< INPUTRDY Offset */
#define AESADV_CPU_INT_RIS_INPUTRDY_MASK         ((uint32_t)0x00000002U)         /* !< This indicates that the engine can
                                                                                    take new input. This should not be
                                                                                    used if DMA handshake is used
                                                                                    (AES_DMA_HS.DMA_DATA_ACK set to 1) */
#define AESADV_CPU_INT_RIS_INPUTRDY_CLR          ((uint32_t)0x00000000U)         /* !< Clear Interrupt Mask */
#define AESADV_CPU_INT_RIS_INPUTRDY_SET          ((uint32_t)0x00000002U)         /* !< Set Interrrupt Mask */
/* AESADV_CPU_INT_RIS[SAVEDCNTXTRDY] Bits */
#define AESADV_CPU_INT_RIS_SAVEDCNTXTRDY_OFS     (2)                             /* !< SAVEDCNTXTRDY Offset */
#define AESADV_CPU_INT_RIS_SAVEDCNTXTRDY_MASK    ((uint32_t)0x00000004U)         /* !< This bit indicates that an AES
                                                                                    authentication TAG and/or IV block(s)
                                                                                    is/are available for the CPU to
                                                                                    retrieve. This bit is only asserted
                                                                                    if the save_context bit is set to 1b.
                                                                                    The bit is mutually exclusive with
                                                                                    the context_ready bit. */
#define AESADV_CPU_INT_RIS_SAVEDCNTXTRDY_CLR     ((uint32_t)0x00000000U)         /* !< Clear Interrupt Mask */
#define AESADV_CPU_INT_RIS_SAVEDCNTXTRDY_SET     ((uint32_t)0x00000004U)         /* !< Set Interrrupt Mask */
/* AESADV_CPU_INT_RIS[CNTXTRDY] Bits */
#define AESADV_CPU_INT_RIS_CNTXTRDY_OFS          (3)                             /* !< CNTXTRDY Offset */
#define AESADV_CPU_INT_RIS_CNTXTRDY_MASK         ((uint32_t)0x00000008U)         /* !< This bit indicates that the context
                                                                                    data registers can be overwritten,
                                                                                    and the CPU is permitted to write
                                                                                    next context. */
#define AESADV_CPU_INT_RIS_CNTXTRDY_CLR          ((uint32_t)0x00000000U)         /* !< Clear Interrupt Mask */
#define AESADV_CPU_INT_RIS_CNTXTRDY_SET          ((uint32_t)0x00000008U)         /* !< Set Interrrupt Mask */

/* AESADV_CPU_INT_MIS Bits */
/* AESADV_CPU_INT_MIS[OUTPUTRDY] Bits */
#define AESADV_CPU_INT_MIS_OUTPUTRDY_OFS         (0)                             /* !< OUTPUTRDY Offset */
#define AESADV_CPU_INT_MIS_OUTPUTRDY_MASK        ((uint32_t)0x00000001U)         /* !< This indicates that the core has an
                                                                                    output available to be read out. This
                                                                                    should not be used if DMA handshake
                                                                                    is used (AES_DMA_HS.DMA_DATA_ACK set
                                                                                    to 1) */
#define AESADV_CPU_INT_MIS_OUTPUTRDY_CLR         ((uint32_t)0x00000000U)         /* !< Interrupt did not occur */
#define AESADV_CPU_INT_MIS_OUTPUTRDY_SET         ((uint32_t)0x00000001U)         /* !< Interrupt occured */
/* AESADV_CPU_INT_MIS[INPUTRDY] Bits */
#define AESADV_CPU_INT_MIS_INPUTRDY_OFS          (1)                             /* !< INPUTRDY Offset */
#define AESADV_CPU_INT_MIS_INPUTRDY_MASK         ((uint32_t)0x00000002U)         /* !< This indicates that the engine can
                                                                                    take new input. This should not be
                                                                                    used if DMA handshake is used
                                                                                    (AES_DMA_HS.DMA_DATA_ACK set to 1) */
#define AESADV_CPU_INT_MIS_INPUTRDY_CLR          ((uint32_t)0x00000000U)         /* !< Clear Interrupt Mask */
#define AESADV_CPU_INT_MIS_INPUTRDY_SET          ((uint32_t)0x00000002U)         /* !< Set Interrrupt Mask */
/* AESADV_CPU_INT_MIS[SAVEDCNTXTRDY] Bits */
#define AESADV_CPU_INT_MIS_SAVEDCNTXTRDY_OFS     (2)                             /* !< SAVEDCNTXTRDY Offset */
#define AESADV_CPU_INT_MIS_SAVEDCNTXTRDY_MASK    ((uint32_t)0x00000004U)         /* !< This bit indicates that an AES
                                                                                    authentication TAG and/or IV block(s)
                                                                                    is/are available for the CPU to
                                                                                    retrieve. This bit is only asserted
                                                                                    if the save_context bit is set to 1b.
                                                                                    The bit is mutually exclusive with
                                                                                    the context_ready bit. */
#define AESADV_CPU_INT_MIS_SAVEDCNTXTRDY_CLR     ((uint32_t)0x00000000U)         /* !< Clear Interrupt Mask */
#define AESADV_CPU_INT_MIS_SAVEDCNTXTRDY_SET     ((uint32_t)0x00000004U)         /* !< Set Interrrupt Mask */
/* AESADV_CPU_INT_MIS[CNTXTRDY] Bits */
#define AESADV_CPU_INT_MIS_CNTXTRDY_OFS          (3)                             /* !< CNTXTRDY Offset */
#define AESADV_CPU_INT_MIS_CNTXTRDY_MASK         ((uint32_t)0x00000008U)         /* !< This bit indicates that the context
                                                                                    data registers can be overwritten,
                                                                                    and the CPU is permitted to write
                                                                                    next context. */
#define AESADV_CPU_INT_MIS_CNTXTRDY_CLR          ((uint32_t)0x00000000U)         /* !< Clear Interrupt Mask */
#define AESADV_CPU_INT_MIS_CNTXTRDY_SET          ((uint32_t)0x00000008U)         /* !< Set Interrrupt Mask */

/* AESADV_CPU_INT_ISET Bits */
/* AESADV_CPU_INT_ISET[OUTPUTRDY] Bits */
#define AESADV_CPU_INT_ISET_OUTPUTRDY_OFS        (0)                             /* !< OUTPUTRDY Offset */
#define AESADV_CPU_INT_ISET_OUTPUTRDY_MASK       ((uint32_t)0x00000001U)         /* !< This indicates that the core has an
                                                                                    output available to be read out. This
                                                                                    should not be used if DMA handshake
                                                                                    is used (AES_DMA_HS.DMA_DATA_ACK set
                                                                                    to 1) */
#define AESADV_CPU_INT_ISET_OUTPUTRDY_NO_EFFECT  ((uint32_t)0x00000000U)         /* !< Writing 0 has no effect */
#define AESADV_CPU_INT_ISET_OUTPUTRDY_SET        ((uint32_t)0x00000001U)         /* !< Set Interrupt */
/* AESADV_CPU_INT_ISET[INPUTRDY] Bits */
#define AESADV_CPU_INT_ISET_INPUTRDY_OFS         (1)                             /* !< INPUTRDY Offset */
#define AESADV_CPU_INT_ISET_INPUTRDY_MASK        ((uint32_t)0x00000002U)         /* !< This indicates that the engine can
                                                                                    take new input.This should not be
                                                                                    used if DMA handshake is used
                                                                                    (AES_DMA_HS.DMA_DATA_ACK set to 1) */
#define AESADV_CPU_INT_ISET_INPUTRDY_CLR         ((uint32_t)0x00000000U)         /* !< Clear Interrupt Mask */
#define AESADV_CPU_INT_ISET_INPUTRDY_SET         ((uint32_t)0x00000002U)         /* !< Set Interrrupt Mask */
/* AESADV_CPU_INT_ISET[SAVEDCNTXTRDY] Bits */
#define AESADV_CPU_INT_ISET_SAVEDCNTXTRDY_OFS    (2)                             /* !< SAVEDCNTXTRDY Offset */
#define AESADV_CPU_INT_ISET_SAVEDCNTXTRDY_MASK   ((uint32_t)0x00000004U)         /* !< This bit indicates that an AES
                                                                                    authentication TAG and/or IV block(s)
                                                                                    is/are available for the CPU to
                                                                                    retrieve. This bit is only asserted
                                                                                    if the save_context bit is set to 1b.
                                                                                    The bit is mutually exclusive with
                                                                                    the context_ready bit. */
#define AESADV_CPU_INT_ISET_SAVEDCNTXTRDY_CLR    ((uint32_t)0x00000000U)         /* !< Clear Interrupt Mask */
#define AESADV_CPU_INT_ISET_SAVEDCNTXTRDY_SET    ((uint32_t)0x00000004U)         /* !< Set Interrrupt Mask */
/* AESADV_CPU_INT_ISET[CNTXTRDY] Bits */
#define AESADV_CPU_INT_ISET_CNTXTRDY_OFS         (3)                             /* !< CNTXTRDY Offset */
#define AESADV_CPU_INT_ISET_CNTXTRDY_MASK        ((uint32_t)0x00000008U)         /* !< This bit indicates that the context
                                                                                    data registers can be overwritten,
                                                                                    and the CPU is permitted to write
                                                                                    next context. */
#define AESADV_CPU_INT_ISET_CNTXTRDY_CLR         ((uint32_t)0x00000000U)         /* !< Clear Interrupt Mask */
#define AESADV_CPU_INT_ISET_CNTXTRDY_SET         ((uint32_t)0x00000008U)         /* !< Set Interrrupt Mask */

