zejun051019/2026-NUEDC-H-MSPM0G3507/include/core/ti/devices/msp/peripherals/hw_aesadv.h
/* AESADV_CPU_INT_ICLR Bits */
/* AESADV_CPU_INT_ICLR[OUTPUTRDY] Bits */
#define AESADV_CPU_INT_ICLR_OUTPUTRDY_OFS        (0)                             /* !< OUTPUTRDY Offset */
#define AESADV_CPU_INT_ICLR_OUTPUTRDY_MASK       ((uint32_t)0x00000001U)         /* !< This indicates that the core has an
                                                                                    output available to be read out. This
                                                                                    should not be used if DMA handshake
                                                                                    is used (AES_DMA_HS.DMA_DATA_ACK set
                                                                                    to 1) */
#define AESADV_CPU_INT_ICLR_OUTPUTRDY_NO_EFFECT  ((uint32_t)0x00000000U)         /* !< Writing 0 has no effect */
#define AESADV_CPU_INT_ICLR_OUTPUTRDY_CLR        ((uint32_t)0x00000001U)         /* !< Clear Interrupt */
/* AESADV_CPU_INT_ICLR[INPUTRDY] Bits */
#define AESADV_CPU_INT_ICLR_INPUTRDY_OFS         (1)                             /* !< INPUTRDY Offset */
#define AESADV_CPU_INT_ICLR_INPUTRDY_MASK        ((uint32_t)0x00000002U)         /* !< This indicates that the engine can
                                                                                    take new input. This should not be
                                                                                    used if DMA handshake is used
                                                                                    (AES_DMA_HS.DMA_DATA_ACK set to 1) */
#define AESADV_CPU_INT_ICLR_INPUTRDY_CLR         ((uint32_t)0x00000000U)         /* !< Clear Interrupt Mask */
#define AESADV_CPU_INT_ICLR_INPUTRDY_SET         ((uint32_t)0x00000002U)         /* !< Set Interrrupt Mask */
/* AESADV_CPU_INT_ICLR[SAVEDCNTXTRDY] Bits */
#define AESADV_CPU_INT_ICLR_SAVEDCNTXTRDY_OFS    (2)                             /* !< SAVEDCNTXTRDY Offset */
#define AESADV_CPU_INT_ICLR_SAVEDCNTXTRDY_MASK   ((uint32_t)0x00000004U)         /* !< This bit indicates that an AES
                                                                                    authentication TAG and/or IV block(s)
                                                                                    is/are available for the CPU to
                                                                                    retrieve. This bit is only asserted
                                                                                    if the save_context bit is set to 1b.
                                                                                    The bit is mutually exclusive with
                                                                                    the context_ready bit. */
#define AESADV_CPU_INT_ICLR_SAVEDCNTXTRDY_CLR    ((uint32_t)0x00000000U)         /* !< Clear Interrupt Mask */
#define AESADV_CPU_INT_ICLR_SAVEDCNTXTRDY_SET    ((uint32_t)0x00000004U)         /* !< Set Interrrupt Mask */
/* AESADV_CPU_INT_ICLR[CNTXTRDY] Bits */
#define AESADV_CPU_INT_ICLR_CNTXTRDY_OFS         (3)                             /* !< CNTXTRDY Offset */
#define AESADV_CPU_INT_ICLR_CNTXTRDY_MASK        ((uint32_t)0x00000008U)         /* !< This bit indicates that the context
                                                                                    data registers can be overwritten,
                                                                                    and the CPU is permitted to write
                                                                                    next context. */
#define AESADV_CPU_INT_ICLR_CNTXTRDY_CLR         ((uint32_t)0x00000000U)         /* !< Clear Interrupt Mask */
#define AESADV_CPU_INT_ICLR_CNTXTRDY_SET         ((uint32_t)0x00000008U)         /* !< Set Interrrupt Mask */

/* AESADV_PWREN Bits */
/* AESADV_PWREN[ENABLE] Bits */
#define AESADV_PWREN_ENABLE_OFS                  (0)                             /* !< ENABLE Offset */
#define AESADV_PWREN_ENABLE_MASK                 ((uint32_t)0x00000001U)         /* !< Enable the power */
#define AESADV_PWREN_ENABLE_DISABLE              ((uint32_t)0x00000000U)         /* !< Disable Power */
#define AESADV_PWREN_ENABLE_ENABLE               ((uint32_t)0x00000001U)         /* !< Enable Power */
/* AESADV_PWREN[KEY] Bits */
#define AESADV_PWREN_KEY_OFS                     (24)                            /* !< KEY Offset */
#define AESADV_PWREN_KEY_MASK                    ((uint32_t)0xFF000000U)         /* !< KEY to allow Power State Change */
#define AESADV_PWREN_KEY_UNLOCK_W                ((uint32_t)0x26000000U)         /* !< KEY to allow write access to this
                                                                                    register */

/* AESADV_RSTCTL Bits */
/* AESADV_RSTCTL[RESETSTKYCLR] Bits */
#define AESADV_RSTCTL_RESETSTKYCLR_OFS           (1)                             /* !< RESETSTKYCLR Offset */
#define AESADV_RSTCTL_RESETSTKYCLR_MASK          ((uint32_t)0x00000002U)         /* !< Clear the RESETSTKY bit in the STAT
                                                                                    register */
#define AESADV_RSTCTL_RESETSTKYCLR_NOP           ((uint32_t)0x00000000U)         /* !< Writing 0 has no effect */
#define AESADV_RSTCTL_RESETSTKYCLR_CLR           ((uint32_t)0x00000002U)         /* !< Clear reset sticky bit */
/* AESADV_RSTCTL[RESETASSERT] Bits */
#define AESADV_RSTCTL_RESETASSERT_OFS            (0)                             /* !< RESETASSERT Offset */
#define AESADV_RSTCTL_RESETASSERT_MASK           ((uint32_t)0x00000001U)         /* !< Assert reset to the peripheral */
#define AESADV_RSTCTL_RESETASSERT_NOP            ((uint32_t)0x00000000U)         /* !< Writing 0 has no effect */
#define AESADV_RSTCTL_RESETASSERT_ASSERT         ((uint32_t)0x00000001U)         /* !< Assert reset */
/* AESADV_RSTCTL[KEY] Bits */
#define AESADV_RSTCTL_KEY_OFS                    (24)                            /* !< KEY Offset */
#define AESADV_RSTCTL_KEY_MASK                   ((uint32_t)0xFF000000U)         /* !< Unlock key */
#define AESADV_RSTCTL_KEY_UNLOCK_W               ((uint32_t)0xB1000000U)         /* !< KEY to allow write access to this
                                                                                    register */

/* AESADV_STAT Bits */
/* AESADV_STAT[RESETSTKY] Bits */
#define AESADV_STAT_RESETSTKY_OFS                (16)                            /* !< RESETSTKY Offset */
#define AESADV_STAT_RESETSTKY_MASK               ((uint32_t)0x00010000U)         /* !< This bit indicates, if the
                                                                                    peripheral was reset, since this bit
                                                                                    was cleared by RESETSTKYCLR in the
                                                                                    RSTCTL register */
#define AESADV_STAT_RESETSTKY_NORES              ((uint32_t)0x00000000U)         /* !< The peripheral has not been reset
                                                                                    since this bit was last cleared by
                                                                                    RESETSTKYCLR in the RSTCTL register */
#define AESADV_STAT_RESETSTKY_RESET              ((uint32_t)0x00010000U)         /* !< The peripheral was reset since the
                                                                                    last bit clear */

