zejun051019/2026-NUEDC-H-MSPM0G3507/include/core/ti/devices/msp/peripherals/hw_aesadv.h
/* AESADV_PDBGCTL Bits */
/* AESADV_PDBGCTL[FREE] Bits */
#define AESADV_PDBGCTL_FREE_OFS                  (0)                             /* !< FREE Offset */
#define AESADV_PDBGCTL_FREE_MASK                 ((uint32_t)0x00000001U)         /* !< Free run control */
#define AESADV_PDBGCTL_FREE_RUN                  ((uint32_t)0x00000001U)         /* !< The peripheral ignores the state of
                                                                                    the Core Halted input */

/* AESADV_EVT_MODE Bits */
/* AESADV_EVT_MODE[INT0_CFG] Bits */
#define AESADV_EVT_MODE_INT0_CFG_OFS             (0)                             /* !< INT0_CFG Offset */
#define AESADV_EVT_MODE_INT0_CFG_MASK            ((uint32_t)0x00000003U)         /* !< Event line mode select for event
                                                                                    corresponding to
                                                                                    [IPSTANDARD.INT_EVENT0] */
#define AESADV_EVT_MODE_INT0_CFG_DISABLE         ((uint32_t)0x00000000U)         /* !< The interrupt or event line is
                                                                                    disabled. */
#define AESADV_EVT_MODE_INT0_CFG_SOFTWARE        ((uint32_t)0x00000001U)         /* !< The interrupt or event line is in
                                                                                    software mode. Software must clear
                                                                                    the RIS. */
#define AESADV_EVT_MODE_INT0_CFG_HARDWARE        ((uint32_t)0x00000002U)         /* !< The interrupt or event line is in
                                                                                    hardware mode. The hardware (another
                                                                                    module) clears automatically the
                                                                                    associated RIS flag. */
/* AESADV_EVT_MODE[EVT1_CFG] Bits */
#define AESADV_EVT_MODE_EVT1_CFG_OFS             (2)                             /* !< EVT1_CFG Offset */
#define AESADV_EVT_MODE_EVT1_CFG_MASK            ((uint32_t)0x0000000CU)         /* !< Event line mode select for event
                                                                                    corresponding to
                                                                                    [IPSTANDARD.INT_EVENT1] */
#define AESADV_EVT_MODE_EVT1_CFG_DISABLE         ((uint32_t)0x00000000U)         /* !< The interrupt or event line is
                                                                                    disabled. */
#define AESADV_EVT_MODE_EVT1_CFG_SOFTWARE        ((uint32_t)0x00000004U)         /* !< The interrupt or event line is in
                                                                                    software mode. Software must clear
                                                                                    the RIS. */
#define AESADV_EVT_MODE_EVT1_CFG_HARDWARE        ((uint32_t)0x00000008U)         /* !< The interrupt or event line is in
                                                                                    hardware mode. The hardware (another
                                                                                    module) clears automatically the
                                                                                    associated RIS flag. */
/* AESADV_EVT_MODE[EVT2_CFG] Bits */
#define AESADV_EVT_MODE_EVT2_CFG_OFS             (4)                             /* !< EVT2_CFG Offset */
#define AESADV_EVT_MODE_EVT2_CFG_MASK            ((uint32_t)0x00000030U)         /* !< Event line mode select for event
                                                                                    corresponding to
                                                                                    [IPSTANDARD.INT_EVENT2] */
#define AESADV_EVT_MODE_EVT2_CFG_DISABLE         ((uint32_t)0x00000000U)         /* !< The interrupt or event line is
                                                                                    disabled. */
#define AESADV_EVT_MODE_EVT2_CFG_SOFTWARE        ((uint32_t)0x00000010U)         /* !< The interrupt or event line is in
                                                                                    software mode. Software must clear
                                                                                    the RIS. */
#define AESADV_EVT_MODE_EVT2_CFG_HARDWARE        ((uint32_t)0x00000020U)         /* !< The interrupt or event line is in
                                                                                    hardware mode. The hardware (another
                                                                                    module) clears automatically the
                                                                                    associated RIS flag. */

/* AESADV_GCMCCM_TAG0 Bits */
/* AESADV_GCMCCM_TAG0[DATA] Bits */
#define AESADV_GCMCCM_TAG0_DATA_OFS              (0)                             /* !< DATA Offset */
#define AESADV_GCMCCM_TAG0_DATA_MASK             ((uint32_t)0xFFFFFFFFU)         /* !< Key data */

/* AESADV_GCMCCM_TAG1 Bits */
/* AESADV_GCMCCM_TAG1[DATA] Bits */
#define AESADV_GCMCCM_TAG1_DATA_OFS              (0)                             /* !< DATA Offset */
#define AESADV_GCMCCM_TAG1_DATA_MASK             ((uint32_t)0xFFFFFFFFU)         /* !< Key data */

/* AESADV_GCMCCM_TAG2 Bits */
/* AESADV_GCMCCM_TAG2[DATA] Bits */
#define AESADV_GCMCCM_TAG2_DATA_OFS              (0)                             /* !< DATA Offset */
#define AESADV_GCMCCM_TAG2_DATA_MASK             ((uint32_t)0xFFFFFFFFU)         /* !< Key data */

/* AESADV_GCMCCM_TAG3 Bits */
/* AESADV_GCMCCM_TAG3[DATA] Bits */
#define AESADV_GCMCCM_TAG3_DATA_OFS              (0)                             /* !< DATA Offset */
#define AESADV_GCMCCM_TAG3_DATA_MASK             ((uint32_t)0xFFFFFFFFU)         /* !< Key data */

