zejun051019/2026-NUEDC-H-MSPM0G3507/include/core/ti/devices/msp/peripherals/hw_aesadv.h
/* AESADV_GHASH_H0 Bits */
/* AESADV_GHASH_H0[DATA] Bits */
#define AESADV_GHASH_H0_DATA_OFS                 (0)                             /* !< DATA Offset */
#define AESADV_GHASH_H0_DATA_MASK                ((uint32_t)0xFFFFFFFFU)         /* !< Key data */

/* AESADV_GHASH_H1 Bits */
/* AESADV_GHASH_H1[DATA] Bits */
#define AESADV_GHASH_H1_DATA_OFS                 (0)                             /* !< DATA Offset */
#define AESADV_GHASH_H1_DATA_MASK                ((uint32_t)0xFFFFFFFFU)         /* !< Key data */

/* AESADV_GHASH_H2 Bits */
/* AESADV_GHASH_H2[DATA] Bits */
#define AESADV_GHASH_H2_DATA_OFS                 (0)                             /* !< DATA Offset */
#define AESADV_GHASH_H2_DATA_MASK                ((uint32_t)0xFFFFFFFFU)         /* !< Key data */

/* AESADV_GHASH_H3 Bits */
/* AESADV_GHASH_H3[DATA] Bits */
#define AESADV_GHASH_H3_DATA_OFS                 (0)                             /* !< DATA Offset */
#define AESADV_GHASH_H3_DATA_MASK                ((uint32_t)0xFFFFFFFFU)         /* !< Key data */

/* AESADV_KEY0 Bits */
/* AESADV_KEY0[DATA] Bits */
#define AESADV_KEY0_DATA_OFS                     (0)                             /* !< DATA Offset */
#define AESADV_KEY0_DATA_MASK                    ((uint32_t)0xFFFFFFFFU)         /* !< Key data */

/* AESADV_KEY1 Bits */
/* AESADV_KEY1[DATA] Bits */
#define AESADV_KEY1_DATA_OFS                     (0)                             /* !< DATA Offset */
#define AESADV_KEY1_DATA_MASK                    ((uint32_t)0xFFFFFFFFU)         /* !< Key data */

/* AESADV_KEY2 Bits */
/* AESADV_KEY2[DATA] Bits */
#define AESADV_KEY2_DATA_OFS                     (0)                             /* !< DATA Offset */
#define AESADV_KEY2_DATA_MASK                    ((uint32_t)0xFFFFFFFFU)         /* !< Key data */

/* AESADV_KEY3 Bits */
/* AESADV_KEY3[DATA] Bits */
#define AESADV_KEY3_DATA_OFS                     (0)                             /* !< DATA Offset */
#define AESADV_KEY3_DATA_MASK                    ((uint32_t)0xFFFFFFFFU)         /* !< Key data */

/* AESADV_KEY4 Bits */
/* AESADV_KEY4[DATA] Bits */
#define AESADV_KEY4_DATA_OFS                     (0)                             /* !< DATA Offset */
#define AESADV_KEY4_DATA_MASK                    ((uint32_t)0xFFFFFFFFU)         /* !< Key data */

/* AESADV_KEY5 Bits */
/* AESADV_KEY5[DATA] Bits */
#define AESADV_KEY5_DATA_OFS                     (0)                             /* !< DATA Offset */
#define AESADV_KEY5_DATA_MASK                    ((uint32_t)0xFFFFFFFFU)         /* !< Key data */

/* AESADV_KEY6 Bits */
/* AESADV_KEY6[DATA] Bits */
#define AESADV_KEY6_DATA_OFS                     (0)                             /* !< DATA Offset */
#define AESADV_KEY6_DATA_MASK                    ((uint32_t)0xFFFFFFFFU)         /* !< Key data */

/* AESADV_KEY7 Bits */
/* AESADV_KEY7[DATA] Bits */
#define AESADV_KEY7_DATA_OFS                     (0)                             /* !< DATA Offset */
#define AESADV_KEY7_DATA_MASK                    ((uint32_t)0xFFFFFFFFU)         /* !< Key data */

/* AESADV_IV0 Bits */
/* AESADV_IV0[DATA] Bits */
#define AESADV_IV0_DATA_OFS                      (0)                             /* !< DATA Offset */
#define AESADV_IV0_DATA_MASK                     ((uint32_t)0xFFFFFFFFU)         /* !< Key data */

/* AESADV_IV1 Bits */
/* AESADV_IV1[DATA] Bits */
#define AESADV_IV1_DATA_OFS                      (0)                             /* !< DATA Offset */
#define AESADV_IV1_DATA_MASK                     ((uint32_t)0xFFFFFFFFU)         /* !< Key data */

/* AESADV_IV2 Bits */
/* AESADV_IV2[DATA] Bits */
#define AESADV_IV2_DATA_OFS                      (0)                             /* !< DATA Offset */
#define AESADV_IV2_DATA_MASK                     ((uint32_t)0xFFFFFFFFU)         /* !< Key data */

/* AESADV_IV3 Bits */
/* AESADV_IV3[DATA] Bits */
#define AESADV_IV3_DATA_OFS                      (0)                             /* !< DATA Offset */
#define AESADV_IV3_DATA_MASK                     ((uint32_t)0xFFFFFFFFU)         /* !< Key data */

/* AESADV_CTRL Bits - AES加密控制寄存器(模式选择/方向/密钥长度/工作状态) */
/* AESADV_CTRL[OUTPUT_RDY] Bits - 输出就绪: 只读, 1=可读取输出数据 */
#define AESADV_CTRL_OUTPUT_RDY_OFS               (0)                             /* !< OUTPUT_RDY Offset */
#define AESADV_CTRL_OUTPUT_RDY_MASK              ((uint32_t)0x00000001U)         /* !< Output Ready. If 1b, this read-only
                                                                                    status bit indicates that an AES
                                                                                    output block is available for the CPU
                                                                                    to retrieve. */
#define AESADV_CTRL_OUTPUT_RDY_NOTREADY          ((uint32_t)0x00000000U)         /* !< Not Ready */
#define AESADV_CTRL_OUTPUT_RDY_READY             ((uint32_t)0x00000001U)         /* !< Ready */
/* AESADV_CTRL[INPUT_RDY] Bits - 输入就绪: 只读, 1=输入缓冲区空可写入新数据 */
#define AESADV_CTRL_INPUT_RDY_OFS                (1)                             /* !< INPUT_RDY Offset */
#define AESADV_CTRL_INPUT_RDY_MASK               ((uint32_t)0x00000002U)         /* !< Ready for input. If 1b, this
                                                                                    read-only status bit indicates that
                                                                                    the 16-byte input buffer is empty,
                                                                                    and the CPU is permitted to write the
                                                                                    next block of data. After reset, this
                                                                                    bit is 0. After writing a context,
                                                                                    this bit will become 1b. */
#define AESADV_CTRL_INPUT_RDY_NOTEMPTY           ((uint32_t)0x00000000U)         /* !< Not Ready */
#define AESADV_CTRL_INPUT_RDY_EMPTY              ((uint32_t)0x00000002U)         /* !< Ready */
/* AESADV_CTRL[DIR] Bits - 方向: 0=解密 1=加密(CBC-MAC必须为1) */
#define AESADV_CTRL_DIR_OFS                      (2)                             /* !< DIR Offset */
#define AESADV_CTRL_DIR_MASK                     ((uint32_t)0x00000004U)         /* !< Direction. If set to 1b an encrypt
                                                                                    operation is performed. If set to 0b
                                                                                    a decrypt operation is performed.
                                                                                    Note: This bit must be written with a
                                                                                    1b when CBC-MAC is selected. */
#define AESADV_CTRL_DIR_DECRYPT                  ((uint32_t)0x00000000U)         /* !< Decryption */
#define AESADV_CTRL_DIR_ENCRYPT                  ((uint32_t)0x00000004U)         /* !< Encryption */
/* AESADV_CTRL[KEYSIZE] Bits - 密钥长度: 01=128位 11=256位 */
#define AESADV_CTRL_KEYSIZE_OFS                  (3)                             /* !< KEYSIZE Offset */
#define AESADV_CTRL_KEYSIZE_MASK                 ((uint32_t)0x00000018U)         /* !< Specifies the encryption strength /
                                                                                    key width */
#define AESADV_CTRL_KEYSIZE_K128                 ((uint32_t)0x00000008U)         /* !< 128-bit key */
#define AESADV_CTRL_KEYSIZE_K256                 ((uint32_t)0x00000018U)         /* !< 256-bit key */
/* AESADV_CTRL[CBC] Bits - CBC模式使能 */
#define AESADV_CTRL_CBC_OFS                      (5)                             /* !< CBC Offset */
#define AESADV_CTRL_CBC_MASK                     ((uint32_t)0x00000020U)         /* !< If set to 1b, cipher-block-chaining
                                                                                    (CBC) mode is selected. */
#define AESADV_CTRL_CBC_DISABLE                  ((uint32_t)0x00000000U)         /* !< Disable CBC mode */
#define AESADV_CTRL_CBC_ENABLE                   ((uint32_t)0x00000020U)         /* !< Select CBC mode */
/* AESADV_CTRL[CTR] Bits - CTR计数器模式使能(GCM/CCM也需置位) */
#define AESADV_CTRL_CTR_OFS                      (6)                             /* !< CTR Offset */
#define AESADV_CTRL_CTR_MASK                     ((uint32_t)0x00000040U)         /* !< If set to 1b, AES counter mode
                                                                                    (CTR) is selected. Note: This bit
                                                                                    must also be set for GCM and CCM,
                                                                                    when encryption/decryption is
                                                                                    required. */
#define AESADV_CTRL_CTR_DISABLE                  ((uint32_t)0x00000000U)         /* !< Disable CBC mode */
#define AESADV_CTRL_CTR_ENABLE                   ((uint32_t)0x00000040U)         /* !< Select CBC mode */
/* AESADV_CTRL[CTR_WIDTH] Bits */
#define AESADV_CTRL_CTR_WIDTH_OFS                (7)                             /* !< CTR_WIDTH Offset */
#define AESADV_CTRL_CTR_WIDTH_MASK               ((uint32_t)0x00000180U)         /* !< When the CTR bit is set, specifies
                                                                                    the counter width for AES-CTR mode.
                                                                                    When the CFB bit is set, specifies
                                                                                    the CFB mode feedback width: */
#define AESADV_CTRL_CTR_WIDTH_CTR32              ((uint32_t)0x00000000U)         /* !< 32-bit counter */
#define AESADV_CTRL_CTR_WIDTH_CFB128             ((uint32_t)0x00000000U)         /* !< CFB-128 mode */
#define AESADV_CTRL_CTR_WIDTH_CTR64              ((uint32_t)0x00000080U)         /* !< 64-bit counter */
#define AESADV_CTRL_CTR_WIDTH_CFB1               ((uint32_t)0x00000080U)         /* !< CFB-1 mode */
#define AESADV_CTRL_CTR_WIDTH_CTR96              ((uint32_t)0x00000100U)         /* !< 96-bit counter */
#define AESADV_CTRL_CTR_WIDTH_CFB8               ((uint32_t)0x00000100U)         /* !< CFB-8 mode */
#define AESADV_CTRL_CTR_WIDTH_CTR128             ((uint32_t)0x00000180U)         /* !< 128-bit counter */
/* AESADV_CTRL[ICM] Bits */
#define AESADV_CTRL_ICM_OFS                      (9)                             /* !< ICM Offset */
#define AESADV_CTRL_ICM_MASK                     ((uint32_t)0x00000200U)         /* !< When the CFB bit is set, specifies
                                                                                    the CFB mode feedback width: */
#define AESADV_CTRL_ICM_DISABLE                  ((uint32_t)0x00000000U)         /* !< Disable CBC mode */
#define AESADV_CTRL_ICM_ENABLE                   ((uint32_t)0x00000200U)         /* !< Select CBC mode */
/* AESADV_CTRL[CFB] Bits */
#define AESADV_CTRL_CFB_OFS                      (10)                            /* !< CFB Offset */
#define AESADV_CTRL_CFB_MASK                     ((uint32_t)0x00000400U)         /* !< If set to 1b, AES cipher feedback
                                                                                    mode CFB is selected. Use the
                                                                                    ctr_width field to specify the
                                                                                    feedback width. */
#define AESADV_CTRL_CFB_DISABLE                  ((uint32_t)0x00000000U)         /* !< Disable CBC mode */
#define AESADV_CTRL_CFB_ENABLE                   ((uint32_t)0x00000400U)         /* !< Select CBC mode */
/* AESADV_CTRL[CBCMAC] Bits */
#define AESADV_CTRL_CBCMAC_OFS                   (15)                            /* !< CBCMAC Offset */
#define AESADV_CTRL_CBCMAC_MASK                  ((uint32_t)0x00008000U)         /* !< If set to 1b, AES-CBC MAC is
                                                                                    selected, the Direction bit must be
                                                                                    set to 1 for this mode. */
#define AESADV_CTRL_CBCMAC_DISABLE               ((uint32_t)0x00000000U)         /* !< Disable CBC mode */
#define AESADV_CTRL_CBCMAC_ENABLE                ((uint32_t)0x00008000U)         /* !< Select CBC mode */
/* AESADV_CTRL[GCM] Bits - GCM模式: 01=GHASH(H加载,Y0=0) 10=GHASH(H加载,Y0内部) 11=全自动(H和Y0内部) */
#define AESADV_CTRL_GCM_OFS                      (16)                            /* !< GCM Offset */
#define AESADV_CTRL_GCM_MASK                     ((uint32_t)0x00030000U)         /* !< If not set to 00b, AES-GCM mode is
                                                                                    selected, this is a combined mode,
                                                                                    using the Galois field multiplier
                                                                                    GF(2128) for authentication and
                                                                                    AES-CTR mode for encryption, the bits
                                                                                    specify the GCM mode: 01b = GHASH
                                                                                    with H loaded and Y0-encrypted forced
                                                                                    to zero 10b = GHASH with H loaded and
                                                                                    Y0-encrypted calculated internally
                                                                                    11b = Autonomous GHASH (both H and
                                                                                    Y0-encrypted calculated internally)
                                                                                    Note: Besides GCM, the CTR mode bits
                                                                                    must also be set to 1b to enable GCM
                                                                                    with AES-CTR; if the CTR bit is not
                                                                                    set a GHASH (authentication) only
                                                                                    operation is performed. A GHASH only
                                                                                    operation is only allowed if the GCM
                                                                                    mode is set to '01b' and the
                                                                                    direction bit is set to '0b'. Other
                                                                                    modes may not be selected in
                                                                                    combination with GCM. Table 14 below
                                                                                    shows the valid combinations for the
                                                                                    GCM and CTR mode bits, all other
                                                                                    options are invalid and must not be
                                                                                    selected. */
#define AESADV_CTRL_GCM_FORCE_ZERO               ((uint32_t)0x00010000U)         /* !< GHASH with H loaded and
                                                                                    Y0-encrypted forced to 0. */
#define AESADV_CTRL_GCM_LOAD_HASH_KEY            ((uint32_t)0x00020000U)         /* !< GHASH with H loaded and
                                                                                    Y0-encrypted calculated internally */
#define AESADV_CTRL_GCM_AUTONOMOUS               ((uint32_t)0x00030000U)         /* !< Autonomous GHASH (both H and
                                                                                    Y0-encrypted calculated internally) */
/* AESADV_CTRL[CCM] Bits - CCM认证加密模式使能(需同时使能CTR) */
#define AESADV_CTRL_CCM_OFS                      (18)                            /* !< CCM Offset */
#define AESADV_CTRL_CCM_MASK                     ((uint32_t)0x00040000U)         /* !< If set to 1b, AES-CCM is selected,
                                                                                    this is a combined mode, using AES
                                                                                    for both authentication and
                                                                                    encryption. In addition to the CCM
                                                                                    bit, the CTR mode bit must be set
                                                                                    such that AES-CTR is enabled. Other
                                                                                    combinations with CCM are invalid. */
#define AESADV_CTRL_CCM_DISABLE                  ((uint32_t)0x00000000U)         /* !< Disable CBC mode */
#define AESADV_CTRL_CCM_ENABLE                   ((uint32_t)0x00040000U)         /* !< Select CBC mode */
/* AESADV_CTRL[CCML] Bits */
#define AESADV_CTRL_CCML_OFS                     (19)                            /* !< CCML Offset */
#define AESADV_CTRL_CCML_MASK                    ((uint32_t)0x00380000U)         /* !< Defines L that indicates the width
                                                                                    of the length field for CCM
                                                                                    operations; the length field in bytes
                                                                                    equals the value of CMM-L plus one.
                                                                                    All values are supported. */
#define AESADV_CTRL_CCML_MINIMUM                 ((uint32_t)0x00000000U)         /* !< Length is 1 */
#define AESADV_CTRL_CCML_MAXIMUM                 ((uint32_t)0x00380000U)         /* !< Length is 8 */
/* AESADV_CTRL[CCMM] Bits */
#define AESADV_CTRL_CCMM_OFS                     (22)                            /* !< CCMM Offset */
#define AESADV_CTRL_CCMM_MASK                    ((uint32_t)0x01C00000U)         /* !< Defines M that indicates the length
                                                                                    of the authentication field for CCM
                                                                                    operations; the authentication field
                                                                                    length equals two times (the value of
                                                                                    CCM-M plus one). Note: The engine
                                                                                    always returns a 128-bit
                                                                                    authentication field, of which the M
                                                                                    least significant bytes are valid.
                                                                                    All values are supported. */
#define AESADV_CTRL_CCMM_MINIMUM                 ((uint32_t)0x00000000U)         /* !< Length is 1 */
#define AESADV_CTRL_CCMM_MAXIMUM                 ((uint32_t)0x01C00000U)         /* !< Length is 8 */
/* AESADV_CTRL[OFB_GCM_CCM_CONT] Bits */
#define AESADV_CTRL_OFB_GCM_CCM_CONT_OFS         (26)                            /* !< OFB_GCM_CCM_CONT Offset */
#define AESADV_CTRL_OFB_GCM_CCM_CONT_MASK        ((uint32_t)0x04000000U)         /* !< This bit has a dual use, depending
                                                                                    on the selection of CCM/GCM, see bits
                                                                                    [18:16]. If CCM/GCM is not selected:
                                                                                    If this bit is set to 1b, full block
                                                                                    AES output feedback mode (OFB-128) is
                                                                                    selected. If CCM/GCM is selected:
                                                                                    Continue processing of an interrupted
                                                                                    AES-GCM or AES-CCM operation in the
                                                                                    AAD phase. Set this write-only signal
                                                                                    to 1b together with the regular mode
                                                                                    bit settings for a GCM or CCM
                                                                                    operation, to continue processing
                                                                                    from the next full AAD block (128
                                                                                    bits) boundary. Before setting this
                                                                                    bit all applicable context to resume
                                                                                    processing must have been loaded into
                                                                                    the engine: Keys, IV, intermediate
                                                                                    digest/TAG, block counter and the CCM
                                                                                    align data word (the latter is for
                                                                                    CCM mode only). The mode can be
                                                                                    written together with this bit, as it
                                                                                    is part of the same register. */
#define AESADV_CTRL_OFB_GCM_CCM_CONT_OFB         ((uint32_t)0x04000000U)         /* !< Enable OFB */
#define AESADV_CTRL_OFB_GCM_CCM_CONT_GCM_CCM_CONTINUE ((uint32_t)0x04000000U)         /* !< Continue GCM/CCM processing in AAD
                                                                                    phase */
/* AESADV_CTRL[GET_DIGEST] Bits */
#define AESADV_CTRL_GET_DIGEST_OFS               (27)                            /* !< GET_DIGEST Offset */
#define AESADV_CTRL_GET_DIGEST_MASK              ((uint32_t)0x08000000U)         /* !< Interrupt processing and generate
                                                                                    an intermediate digest during an
                                                                                    AES-GCM or AES-CCM operation. Set
                                                                                    this write-only signal to 1b to
                                                                                    interrupt GCM or CCM processing at
                                                                                    the next full block (128 bits)
