zejun051019/2026-NUEDC-H-MSPM0G3507/include/core/ti/devices/msp/peripherals/hw_aesadv.h
/* AESADV_C_LENGTH_1 Bits */
/* AESADV_C_LENGTH_1[DATA] Bits */
#define AESADV_C_LENGTH_1_DATA_OFS               (0)                             /* !< DATA Offset */
#define AESADV_C_LENGTH_1_DATA_MASK              ((uint32_t)0x1FFFFFFFU)         /* !< Bits [60:0] of the crypto length
                                                                                    registers (LSW and MSW) store the
                                                                                    cryptographic data length in bytes
                                                                                    for all modes. Once processing with
                                                                                    this context is started, this length
                                                                                    decrements to zero. Data lengths up
                                                                                    to (261-1) bytes are allowed. For
                                                                                    GCM, any value up to 236-32 bytes can
                                                                                    be used. This is because a 32-bit
                                                                                    counter mode is used; the maximum
                                                                                    number of 128-bit blocks is 232-2,
                                                                                    resulting in a maximum number of
                                                                                    bytes of 236-32. A write to this
                                                                                    register triggers the engine to start
                                                                                    using this context. This is valid for
                                                                                    all modes except GCM and CCM. Note
                                                                                    that for the combined modes, this
                                                                                    length does not include the
                                                                                    authentication only data; the
                                                                                    authentication length is specified in
                                                                                    the AES_AAD_LENGTH register below.
                                                                                    All modes must have a length > 0. For
                                                                                    the combined modes, it is allowed to
                                                                                    have one of the lengths equal to
                                                                                    zero. For the basic encryption modes
                                                                                    (ECB/CBC/CTR/ICM/CFB/OFB) it is
                                                                                    allowed to program zero to the length
                                                                                    field; in that case the length is
                                                                                    assumed infinite. All data must be
                                                                                    byte (8-bit) aligned for stream
                                                                                    cipher modes; bit aligned data
                                                                                    streams are not supported. For block
                                                                                    cipher modes, the data length must be
                                                                                    programmed in multiples of the block
                                                                                    cipher size, 16 bytes. */

/* AESADV_AAD_LENGTH Bits */
/* AESADV_AAD_LENGTH[DATA] Bits */
#define AESADV_AAD_LENGTH_DATA_OFS               (0)                             /* !< DATA Offset */
#define AESADV_AAD_LENGTH_DATA_MASK              ((uint32_t)0xFFFFFFFFU)         /* !< Bits [31:0] of the authentication
                                                                                    length register store the
                                                                                    authentication data length in bytes
                                                                                    for combined modes only (GCM or CCM)
                                                                                    Supported AAD-lengths for CCM are
                                                                                    from 0 to (216-28) bytes. For GCM any
                                                                                    value up to (232-1) bytes can be
                                                                                    used. Once processing with this
                                                                                    context is started, this length
                                                                                    decrements to zero. A write to this
                                                                                    register triggers the engine to start
                                                                                    using this context for GCM and CCM. */

/* AESADV_DATA0 Bits */
/* AESADV_DATA0[DATA] Bits */
#define AESADV_DATA0_DATA_OFS                    (0)                             /* !< DATA Offset */
#define AESADV_DATA0_DATA_MASK                   ((uint32_t)0xFFFFFFFFU)         /* !< Data */

/* AESADV_DATA1 Bits */
/* AESADV_DATA1[DATA] Bits */
#define AESADV_DATA1_DATA_OFS                    (0)                             /* !< DATA Offset */
#define AESADV_DATA1_DATA_MASK                   ((uint32_t)0xFFFFFFFFU)         /* !< Data */

