zejun051019/2026-NUEDC-H-MSPM0G3507/include/core/ti/devices/msp/peripherals/hw_aesadv.h
/* AESADV_STATUS Bits */
/* AESADV_STATUS[KEYWR] Bits */
#define AESADV_STATUS_KEYWR_OFS                  (0)                             /* !< KEYWR Offset */
#define AESADV_STATUS_KEYWR_MASK                 ((uint32_t)0x00000001U)         /* !< Key write status. 0 - user write to
                                                                                    KEY register is allowed. 1 - user
                                                                                    write to KEY register is ignored. In
                                                                                    order to allow user write, perform a
                                                                                    module reset. */
#define AESADV_STATUS_KEYWR_ENABLED              ((uint32_t)0x00000000U)         /* !< User write to KEY MMR is allowed */
#define AESADV_STATUS_KEYWR_DISABLED             ((uint32_t)0x00000001U)         /* !< User write to KEY MMR is disabled.
                                                                                    Writing has no effect. */

/* AESADV_DATA_IN Bits */
/* AESADV_DATA_IN[DATA] Bits */
#define AESADV_DATA_IN_DATA_OFS                  (0)                             /* !< DATA Offset */
#define AESADV_DATA_IN_DATA_MASK                 ((uint32_t)0xFFFFFFFFU)         /* !< Data input word */

/* AESADV_DATA_OUT Bits */
/* AESADV_DATA_OUT[DATA] Bits */
#define AESADV_DATA_OUT_DATA_OFS                 (0)                             /* !< DATA Offset */
#define AESADV_DATA_OUT_DATA_MASK                ((uint32_t)0xFFFFFFFFU)         /* !< Data output word */

/* AESADV_FORCE_IN_AV Bits */
/* AESADV_FORCE_IN_AV[DATA] Bits */
#define AESADV_FORCE_IN_AV_DATA_OFS              (0)                             /* !< DATA Offset */
#define AESADV_FORCE_IN_AV_DATA_MASK             ((uint32_t)0xFFFFFFFFU)         /* !< Any write to this register forces
                                                                                    the input data buffer to valid and
                                                                                    will force the engine to start
                                                                                    processing this data. The data
                                                                                    written here is not used. The core
                                                                                    must be configured to have input and
                                                                                    output data acknowledge be I/O
                                                                                    register based */

/* AESADV_CCM_ALN_WRD Bits */
/* AESADV_CCM_ALN_WRD[DATA] Bits */
#define AESADV_CCM_ALN_WRD_DATA_OFS              (0)                             /* !< DATA Offset */
#define AESADV_CCM_ALN_WRD_DATA_MASK             ((uint32_t)0xFFFFFFFFU)         /* !< This register provides a means to
                                                                                    access an internal register that
                                                                                    stores alignment data bytes during
                                                                                    the AAD phase of AES-CCM processing.
                                                                                    This register needs to be read and
                                                                                    stored when an AES-CCM operation is
                                                                                    interrupted during the AAD phase.
                                                                                    This value needs to be restored by
                                                                                    writing this register, when resuming
                                                                                    that AES-CCM operation in a later
                                                                                    session. */

/* AESADV_BLK_CNT0 Bits */
/* AESADV_BLK_CNT0[DATA] Bits */
#define AESADV_BLK_CNT0_DATA_OFS                 (0)                             /* !< DATA Offset */
#define AESADV_BLK_CNT0_DATA_MASK                ((uint32_t)0xFFFFFFFFU)         /* !< Internal block counter for AES GCM
                                                                                    and CCM operations. These bits read
                                                                                    the block count value that represents
                                                                                    the number of blocks to go. This
                                                                                    value is valid with
                                                                                    saved_context_ready after a request
                                                                                    for an intermediate GCM/CCM digest.
                                                                                    Writing these registers will restore
                                                                                    the internal block counter to the
                                                                                    programmed value. This only needs to
                                                                                    be done to prepare the engine to
                                                                                    continue processing of an interrupted
                                                                                    GCM or CCM operation. Also refer to
                                                                                    the get_digest and gcm_ccm_continue
                                                                                    bits in AES_CTRL register. */

/* AESADV_BLK_CNT1 Bits */
/* AESADV_BLK_CNT1[DATA] Bits */
#define AESADV_BLK_CNT1_DATA_OFS                 (0)                             /* !< DATA Offset */
#define AESADV_BLK_CNT1_DATA_MASK                ((uint32_t)0x00FFFFFFU)         /* !< Internal block counter for AES GCM
                                                                                    and CCM operations. These bits read
                                                                                    the block count value that represents
                                                                                    the number of blocks to go. This
                                                                                    value is valid with
                                                                                    saved_context_ready after a request
                                                                                    for an intermediate GCM/CCM digest.
                                                                                    Writing these registers will restore
                                                                                    the internal block counter to the
                                                                                    programmed value. This only needs to
                                                                                    be done to prepare the engine to
                                                                                    continue processing of an interrupted
                                                                                    GCM or CCM operation. Also refer to
                                                                                    the get_digest and gcm_ccm_continue
                                                                                    bits in AES_CTRL register. */

/* AESADV_DMA_HS Bits */
/* AESADV_DMA_HS[DMA_DATA_ACK] Bits */
#define AESADV_DMA_HS_DMA_DATA_ACK_OFS           (0)                             /* !< DMA_DATA_ACK Offset */
#define AESADV_DMA_HS_DMA_DATA_ACK_MASK          ((uint32_t)0x00000001U)         /* !< When this bit is 0b, input and
                                                                                    output data acknowledge is I/O
                                                                                    register based, as specified in the
                                                                                    description of the AES_DATA_IN_n /
                                                                                    AES_DATA_OUT_n registers. When this
                                                                                    bit is 1b, input and ouput data
                                                                                    acknowledge is based on DMA handshake
                                                                                    signals. */
#define AESADV_DMA_HS_DMA_DATA_ACK_DMA_DISABLE   ((uint32_t)0x00000000U)         /* !< Disable DMA based data handshake */
#define AESADV_DMA_HS_DMA_DATA_ACK_DMA_ENABLE    ((uint32_t)0x00000001U)         /* !< Enables DMA based handshake */


#ifdef __cplusplus
}
#endif

#endif /* ti_devices_msp_peripherals_hw_aesadv__include */

